Revit 2027 API
AssetPropertyFloat.IsValidValue Method
 Checks that the value is a valid value for this property.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidValue(
	float value
)
Public Function IsValidValue (
	value As Single
) As Boolean
public:
bool IsValidValue(
	float value
)
member IsValidValue :
        value : float32 -> bool
Parameters
value Single
 The value to be checked.
Return Value
Boolean
 True if the value is valid for the property.
Exceptions
Exception | Condition
InvalidOperationException |  Cannot check validity for a property not being edited in AppearanceAssetEditScope.
See Also
Reference
AssetPropertyFloat Class
Autodesk.Revit.DB.Visual Namespace